clc
clear all
close all
syms x
photo=[0.0457143	0.990196
0.0514286	0.843137
0.0685714	0.696078
0.08	0.588235
0.108571	0.480392
0.142857	0.382353
0.177143	0.313725
0.205714	0.27451
0.245714	0.22549
0.308571	0.186275
0.354286	0.176471
0.405714	0.166667
0.462857	0.156863
0.531429	0.147059
0.6	0.147059
0.662857	0.137255
0.742857	0.137255
0.822857	0.137255
0.897143	0.127451];
p1=photo(:,1);
p2=photo(:,2);
t1=[0.04:0.02:0.08];
t2=[0.08:0.02:0.8];
%General model Gauss3:
%Coefficients (with 95% confidence bounds):
       a1 =  4.579e+013;% (-2.297e+017, 2.297e+017)
       b1 =      -1.109; % (-180.6, 178.4)
       c1 =      0.2022; % (-15.68, 16.09)
       a2 =      0.8256;  %(-9.309, 10.96)
       b2 =     -0.1186 ; %(-2.098, 1.861)
       c2 =      0.2211 ; %(-0.5672, 1.009)
       a3 =       62.04 ; %(-1.816e+005, 1.817e+005)
       b3 =      -25.82;  %(-1.278e+004, 1.273e+004)
       c3 =       10.74;  %(-2575, 2596)
       f =   a1*exp(-((x-b1)/c1)^2) + a2*exp(-((x-b2)/c2)^2) +  a3*exp(-((x-b3)/c3)^2);
       %plot(photo(:,1),photo(:,2));
       %hold on
      
fig1=figure;
xSize = 3;%3; 
ySize = 2.25%2.25;                            %  图片的长和高，3英寸 x 2.25英寸
xLeft = (6-xSize)/2;  yTop = (10-ySize)/2;  
set(fig1,'Units','inches');                                %  单位为英寸
set(fig1,'position',[xLeft yTop xSize ySize]);  % 图片在屏幕上显示的位置
set(fig1,'PaperUnits','inches');                       %  单位为英寸
set(fig1,'PaperPosition',[xLeft yTop xSize ySize]);  % 图片在“纸上”显示的位置
%%%%%%%%%%%%%%%画图%%%%%%%%%%%%%%%%%%%%%%%
 plot(t1,subs(f,t1),'k--')
 hold on
 plot(t2,subs(f,t2),'k')
 axis([0 0.8 0 1])
 set(gca,'xtick',0:0.25:0.8)
 set(gca,'ytick',0:0.5:1) 		
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
set(gca,'fontsize',9);           % 坐标轴上的数字字号为9 pt
h1 = xlabel('光杆速度(m/s)'); h2 = ylabel('无量纲阻尼系数');   % 坐标轴名称
set(h1,'fontsize',9);             %  X轴的字号为9 pt
set(h2,'fontsize',9);             %  Y轴的字号为9 pt
print('-djpeg','-r600','无量纲阻尼系数')          % 以600 dpi的分辨率输出一个JPG 图片
print('-dtiff','-r300','无量纲阻尼系数')  % 以300 dpi的分辨率输出一个tiff 的 图片
saveas(gcf,'无量纲阻尼系数.fig')% 输出fig


