#pragma once
#include"parameter.h"
#include"HpRandom.h"
int c[4][8]={{1,0,0,0,1,0,0,0},{0,1,0,0,0,1,0,0},{0,0,1,0,0,0,1,0},{0,0,0,1,0,0,0,1}};
int a[400][8]={{1,1,2,1,1,2,1,5},{5,0,6,3,4,2,2,3},{3,1,3,0,2,4,5,1},{4,5,4,0,2,4,2,0},{6,1,4,2,3,1,2,1},{0,0,3,0,0,6,4,3},{6,2,7,9,3,0,3,5},{4,3,5,3,1,5,1,3},{2,4,1,9,3,5,6,4},{3,2,5,1,7,5,2,5}};
int s[8]={4,4,4,4,4,4,4,4};
int td1=0;//起动时延时
int td2=0;//由于黄灯停止的延误
int ty=0;//黄灯时间
int Nmin=10;
int Nmax=60;
int Lmin=48;
int Lmax=140;
int v0=0;
void init_parameter(){
	//for(int i=0;i<400;i++){
	//	for(int j=0;j<8;j++){
	//		a[i][j]=HpRandom::getNextPossion(2);
	//	}
	//}
}
