%问题1的求解
close all;
%k1=0.5*1000*651.3*80*40*10^(-6);
% k2=0.5*1000*651.3*80*80*10^(-6);
%k1=1.6;
%k2=1.6;
%k1=0.5*1000*900*10^(-6)*80*40*10^(-6);
%k2=0.5*1000*900*10^(-6)*80*80*10^(-6);
syms k1;
syms k2;
 m=2300*80*80*40*10^(-9);
  c1=0.34;
  c2=m/k1*c1;
  f=80*80*40*10^(-9)*1000*9.8;
  g=m*9.8;
  c3=(g-f)/k2;
  c4=0.275-m/k2*c3;
  
  t=0:0.04:0.4;
  x=0.34*t-m/k1*c1*exp(-k1/m*t)+c2;
  y=(f-g)/k2*t+m/k2*c3*exp(k2/m*t)+c4;

  rr= xlsread('34(1).xls');  % 从文件data.xls中读取数据
  m_data=rr(:,:);%取得表中除去第0行第0列之外的所有数据
  x1=m_data(38,1:11);
  y1=m_data(37,1:11);
  
  %figure;
%  plot(t,x);
 % figure;
%  plot(t,y);
  %figure;

  %下面是用二次方关系解得的函数关系式
  t=0:0.04:0.4;
  xx=1.1676*0.5043*((1.9843*t-0.6742)*atan(1.9843*t-0.6742)-0.5*log(1+(1.9843*t-0.6742)^2)+0.5872)+0.6926*t;
  
  plot(t,xx);
  
%   p1=polyfit(x1,y1,2);
%   plot(x1,y1,'o');
%   hold on;
%   plot(x1,polyval(p1,x1));
%   figure;
 % plot(t,y1);
  %plot(x*100,y*100);
  
 