%--------------------------------------------------------------------------
%              读取各种格式的数据
%--------------------------------------------------------------------------
%***********************读取xls格式的数据*******************************
%注意：用xlsread读取的数据行列都是从零开始的
%*********************读取xls格式数据，提取出数值数据************************
x34 = xlsread('34(1).xls');  % 从文件data.xls中读取数据
m_data34=x34(:,:);%取得表中除去第0行第0列之外的所有数据

x40 = xlsread('40(1).xls');  % 从文件data.xls中读取数据
m_data40=x40(:,:);%取得表中除去第0行第0列之外的所有数据

x47 = xlsread('47(1).xls');  % 从文件data.xls中读取数据
m_data47=x47(:,:);%取得表中除去第0行第0列之外的所有数据

x55 = xlsread('55(1).xls');  % 从文件data.xls中读取数据
m_data55=x55(:,:);%取得表中除去第0行第0列之外的所有数据
%平放
y1=m_data34(37,1:11);
x1=m_data34(38,1:11);

y2=m_data40(37,1:8);
x2=m_data40(38,1:8);

y3=m_data47(37,1:12);
x3=m_data47(38,1:12);

y4=m_data55(37,1:12);
x4=m_data55(38,1:12);

% plot(x1,y1,'g');
% hold on;
% plot(x2,y2,'r');
% hold on;
% plot(x3,y3,'k');
% hold on;
% plot(x4,y4,'m');

% xlabel('x坐标');
% ylabel('y坐标');
% title('平放时不同流速对x,y关系的影响');
% legend('流速为0.34','流速为0.4','流速为0.47','流速为0.55');
% %立方
% y2=m_data34(39,1:9);
% x2=m_data34(40,1:9);
% 
% 
% %竖放
% y3=m_data34(41,1:9);
% x3=m_data34(42,1:9);
% plot(x1,y1,'ko',x1,y1,'r');
% hold on;
% plot(x2,y2,'k+',x2,y2,'g');
% hold on;
% plot(x3,y3,'kx',x3,y3,'b');
% xlabel('x坐标');
% ylabel('y坐标');
% title('大实心方砖不同投放方式下的运动轨迹图');
% legend('平放','立方','竖放');
% 
% 
%数据校正
i_x=atan((25-x1)/120);
r_x=asin(sin(i_x)/1.33);
delta_x1=20*tan(r_x);
x11=abs(x1-delta_x1);%修正后的横坐标

%if y1>20
    i_y=atan((y1-20)/120);
%else
   % i_y=atan((20-y1)/120);
r_y=asin(sin(i_y)/1.33);
delta_y1=20*tan(r_y);
y11=y1+delta_y1;

figure;
t=0:0.04:0.4;
%plot(x11,y11);
plot(t,x11);




% 
% 
% %拟合
% figure;
% p1=polyfit(x11,y11,1);
% z1=polyval(p1,x11);
% plot(x11,y11,'o',x11,z1);
% 





































