%       将一个子弹的每一个次棱426384x3数据转换为756*564的矩阵 DATE：200909
%       其中t22_c1为转换成矩阵形式后的第一个次棱数据，其中t22为子弹编号
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
load c1.dat     %将第一个次棱的原始数据读入
load c2.dat     %第二个
load c3.dat     %。。
load c4.dat     %

for i=1:426384
t22_c1(ceil(i/564),i-ceil(i/564)*564+564)=c1(i,3);      %第一个次棱的变化
t22_c2(ceil(i/564),i-ceil(i/564)*564+564)=c2(i,3);
t22_c3(ceil(i/564),i-ceil(i/564)*564+564)=c3(i,3);
t22_c4(ceil(i/564),i-ceil(i/564)*564+564)=c4(i,3);
end
save t22.mat t22_c1 t22_c2 t22_c3 t22_c4    %转换后的矩阵存储起来
clear all                                   %清理系统内存
