function q1_regressF_1_234
%使用回归模型分析四个指标之间的数量关系

%第一步：读取原始数据并标准化
indexdata=load('index_4_Sdata.txt');
[n,col]=size(indexdata);

%p=10;
%p=9;
%p=8;
%p=7;
%p=6;
%p=5;
p=4;

fR=p-1;
fRe=n-p;

y=indexdata(:,1);
m1=indexdata(:,2);
m2=indexdata(:,3);
m3=indexdata(:,4);

%**************************************************************************
%P=[0.00123,0.26966,12.54861,-15.94221,-0.32597,-1230.78026,...
%   6830.96275,44.22223,-21.21437,-24682.29558]';
P=[0.2512
-0.2827
4945.20222
-23976.58958
];
yy=P(1)*m1+P(2)*m1.^2+...
    P(3)*m3.^2+P(4)*m2.*m3;
%**************************************************************************

SSRe=sum((y-yy).^2);
SST=sum((y-mean(y)).^2);
SSR=SST-SSRe;
F=(SSR/fR)/(SSRe/fRe);
FF=[fR,fRe,F,SSRe,SST,SSR]

%第二步：回归的拟合不佳检验，将指标1分为6组，在计算误差平方和以及模型误差平方和


%第三步：模型的选择，即系数相关性检验，引入新变量偏回归平方和SS
%XX=[ones(n,1),m1,m2,m3,m1.^2,m2.^2,m3.^2,m1.*m2,m1.*m3,m2.*m3];
%XX=[ones(n,1),m1,m2,m3,m1.^2,m3.^2,m1.*m2,m1.*m3,m2.*m3];
%XX=[m1,m2,m3,m1.^2,m3.^2,m1.*m2,m1.*m3,m2.*m3];
%XX=[m1,m3,m1.^2,m3.^2,m1.*m2,m1.*m3,m2.*m3];
%XX=[m1,m3,m1.^2,m3.^2,m1.*m3,m2.*m3];
%XX=[m1,m3,m1.^2,m3.^2,m2.*m3];
XX=[m1,m1.^2,m3.^2,m2.*m3];

XX=inv(XX'*XX);
cjj=diag(XX);
SSj=P.^2./cjj;
FFF=SSj/(SSRe/fRe)
F1fRe=[1,fRe]
